package chris.dream.regex;

import java.util.ArrayList;
import java.util.List;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class TimeRegex {
	
	private final static String TIME_REGEX = "(([0-9\uFF10-\uFF19]{1,2}[月底初]{1,2}"
			+ "[0-9\uFF10-\uFF19]{0,2}[日号]{0,1}[\\s|.]{0,1}"
			+ "\\d{0,2}[:时点刻]{0,1}\\d{0,2}[:分钟]{0,2}\\d{0,2}[秒]{0,2})[\\s\\S]*?)|"
			+ "([0-9\uFF10-\uFF19]{1,3}[日天])|" 
			+ "([一二三四五六七八九十]{0,2}[月底初]{1,2}[一二三四五六七八九十]{0,3}[日号]{0,1})|"
			+ "((?<datetime>[0-9零〇一二三四五六七八九十]{4}[年]{1}[0-9一二三四五六七八九十]{0,2}[月底初]{0,3}"
			+ "[一二三四五六七八九十0-9]{0,2}[日号]{0,1}[\\s|.]"
			+ "{0,1}\\d{0,2}[:时点刻]{0,1}\\d{0,2}[:分钟]{0,2}\\d{0,2}[秒]{0,2})[\\s\\S]*?)|"
			+ "([012\uFF10\uFF11\uFF19]{0,1}[0-9\uFF10-\uFF19][:：点时h]"
			+ "[0-3\uFF10-\uFF12\uFF19][0-9半\uFF10-\uFF19][:：分m种]{0,2}"
			+ "[0-6\uFF10-\uFF15\uFF109]{0,1}[0-9\uFF10-\uFF19]{0,1}[秒s]{0,1})|"
			+ "([零一二三四五六七八九十半个]{0,3}[点小时]{0,2}[零一二三四五六七八九十半]{1,3}[分钟]{1,2}[零一二三四五六七八九十半]{1,3}(秒)?)|"
			+ "(^(1|2)[0-9]{3}[-/.]"
			+ "(([1-9]|0[1-9]|1[0-2])[-/.]([1-9]|0[1-9]|1[0-9]|2[0-8])|"
			+ "([13-9]|0[13-9]|1[0-2])"
			+ "[-/.](29|30)|([13578]|0[13578]|1[02])[-/.]31)"
			+ "([-/.]|\\s{0,})\\d{0,2}:{0,1}\\d{0,2}:{0,1}\\d{0,2}[\\s\\S]*?)";
	
	public static void main(String[] args) {
		String content = "    诈骗的方式现在是多种多样，前不久有出现利用涉世不深的年轻人对偶像的热爱来诈骗获取钱财的手段。2016年初，"
				+ "兴化的邹雨（化名）在给偶像刷票时遭遇骗局，损失一万多元。"
				+ "邹雨今年刚刚大三，华南理工大学的学生，她和许多同龄人一样，喜欢追星。"
				+ "今年7月，某平台网上发起了一场“app粉丝节”的投票活动，为了能让自己的偶像在投票中获胜，小邹决定花钱请“专业人士”为偶像刷票。"
				+ "小邹在网上通过QQ，找到了一位QQ号：352739573的刷票卖家，自称是某平台这次活动的设计师，"
				+ "但是对方不同意通过网购的第三方平台交易，而是要让小邹把钱转账汇款到建设银行账号：6227000267090232680的；"
				+ "并且还提出要先付钱之后才给刷票的要求。小邹起初不放心，要求留下对方电话号码，"
				+ "对方很爽快的留下了自己的电话：15611920818以及身份证号码：330726196507040016 。"
				+ "在与这位“专业人士”讨价还价后，小邹决定以1万2千元来换取10万份投票数。"
				+ "由于之前没有进行过类似交易，半信半疑的小邹先后分3次给对方转了500元、1000元和2000元。"
				+ "小邹说，在汇款的过程中，她发现偶像的票数突然上涨了几百，这样她就打消了心中的疑惑。在将1万2千元全款转进相应账户后，小邹发现自己的偶像，"
				+ "得到的票数直到活动结束，都没有明显增涨。小邹赶紧又联系对方，对方表示因为刷票不成功，到时候将统一退款。"
				+ "当小邹询问对方何时能退款的时候，“嚣张”的骗子竟然还嘲笑小邹“都不知道自己被骗了”，并且还把小邹给拉黑了……发现被骗后，不知所措的邹雨选择了报警，"
				+ "当地派出所民警立即与兴化市公安局网监大队取得联系，在网络中进行轨迹研判，经过缜密侦查，办案民警发现中山市的陈某某重大嫌疑。"
				+ "当警方对陈某某实施抓捕行动的时候，发现嫌疑人经常乘坐的车辆“粤AEA369”已经在前往机场的路上，准备飞往泰国。"
				+ "警察马上联系机场方面，根据机场提供的护照号：E23817750确定了嫌疑人的位置并实施了抓捕。最终，在广东当地警方的支持下，陈某落入法网。"
				+ "陈某对违法事实供认不讳，并且退还了全部的赃款。在这个诈骗案例中，其实我们应该想到，邹雨的行为从源头上来说，"
				+ "就是一种造假行为，也正是她这种迫切想为偶像出力的心态，让骗子钻了空子。追星本来也无可厚非，如果小邹通过正常的渠道，而不是急功近利，也就不会被骗了。"
				+ "----来自新浪新闻客户端，来稿请投news@sina.com";
		System.out.println(extractTimes(content));
		
	}
	
	public static List<String> extractTimes(String content) {
		Pattern pattern = Pattern.compile(TIME_REGEX);
		Matcher matcher = pattern.matcher(content);
		List<String> times = new ArrayList<>();
		while(matcher.find()) {
			times.add(matcher.group());
		}
		return times;
	}

}
